# У межах вашої організації, ви відповідаєте за організацію привітань колег з днем народження. 
# Щоб оптимізувати цей процес, вам потрібно створити функцію get_upcoming_birthdays, 
# яка допоможе вам визначати, кого з колег потрібно привітати. 
# Функція повинна повернути список всіх у кого день народження вперед на 7 днів включаючи поточний день.

# У вашому розпорядженні є список users, кожен елемент якого містить інформацію про ім'я користувача та 
# його день народження. Оскільки дні народження колег можуть припадати на вихідні, 
# ваша функція також повинна враховувати це та переносити дату привітання на наступний робочий день, якщо необхідно.



# Вимоги до завдання:

# Параметр функції users - це список словників, де кожен словник містить ключі name (ім'я користувача, рядок) 
# та birthday (день народження, рядок у форматі 'рік.місяць.дата').
# Функція має визначати, чиї дні народження випадають вперед на 7 днів включаючи поточний день. 
# Якщо день народження припадає на вихідний, дата привітання переноситься на наступний понеділок.
# Функція повертає список словників, де кожен словник містить інформацію про користувача (ключ name) 
# та дату привітання (ключ congratulation_date, дані якого у форматі рядка 'рік.місяць.дата').


# Рекомендації для виконання:

# Припускаємо, що ви отримали список users, де кожен словник містить name (ім'я користувача) 
# та birthday (дата народження у форматі рядка 'рік.місяць.дата'). 
# Ви повинні перетворити дати народження з рядків у об'єкти datetime. 
# Конвертуйте дату народження із рядка у datetime об'єкт - datetime.strptime(user["birthday"], "%Y.%m.%d").date(). 
# Оскільки потрібна лише дата (без часу), використовуйте .date() для отримання тільки дати.
# Визначте поточну дату системи за допомогою datetime.today().date().
# Пройдіться по списку users та аналізуйте дати народження кожного користувача (for user in users:).
# Перевірте, чи вже минув день народження в цьому році (if birthday_this_year < today). 
# Якщо так, розгляньте дату на наступний рік.
# Визначте різницю між днем народження та поточним днем для визначення днів народження на наступний тиждень.
# Перевірте, чи день народження припадає на вихідний. Якщо так, перенесіть дату привітання на наступний понеділок.
# Створіть структуру даних, яка зберігатиме ім'я користувача та відповідну дату привітання, 
# якщо день народження відбувається протягом наступного тижня.
# Виведіть зібрані дані у вигляді списку словників з іменами користувачів та датами привітань.


# Критерії оцінювання:

# Актуальність та коректність визначення днів народження на 7 днів вперед.
# Правильність обробки випадків, коли дні народження припадають на вихідні.
# Читабельність та структурованість коду.


# Приклад:

# Припустимо, у вас є список users:

# users = [
#     {"name": "John Doe", "birthday": "1985.01.23"},
#     {"name": "Jane Smith", "birthday": "1990.01.27"}
# ]

# Використання функції get_upcoming_birthdays:

# upcoming_birthdays = get_upcoming_birthdays(users)
# print("Список привітань на цьому тижні:", upcoming_birthdays)

# Якщо сьогодні 2024.01.22 результатом може бути:

# [
#     {'name': 'John Doe', 'congratulation_date': '2024.01.23'}, 
#     {'name': 'Jane Smith', 'congratulation_date': '2024.01.29'}
# ]

# Цей список містить інформацію про те, кого і коли потрібно привітати з днем народження.

from datetime import datetime, timedelta
# приймаємо список наших працівників
users = [
    {"name": "John Doe", "birthday": "1985.10.23"},
    {"name": "Jane Smith", "birthday": "1990.10.27"},
    {'name': 'Anna Smith', 'birthday': '2000.10.01'}
]
# Створюємо сьогоднішню дату
today = datetime.today().date()
# Створюємо список працівників у яких на цьому тижні буде день народження  
upcoming_birthdays = []

def get_upcoming_birthdays (users):
    # Перевіряємо кожного працівника
    for user in users:
        # Перетворюємо стрінгу на дату
         birthday = datetime.strptime(user["birthday"], "%Y.%m.%d").date()
        #  перетворюємо рік народження в на теперішній рік
         birthday_this_year = birthday.replace(year=today.year)
        #  Перевіряємо чи день народження меньше за цьогоднішній день (тобто день народження пройшов)
         if birthday_this_year < today:
            #  якщо так то додаємо його на наступний рік
            birthday_this_year = birthday_this_year.replace(year=today.year + 1)
        # якщо ні то рахуємо скільки днів залишилось до дня народження
         days_until_birthday = (birthday_this_year - today).days
        # Перевіряємо щоб день народження був в межах від 0 до 7 днів
         if 0 <= days_until_birthday <= 7:
            #  Створюємо зміну з днями народження на 7 днів наперед
            congratulation_date = birthday_this_year
        #    Перевіряємо який це день тижня 5(субота) 6(неділя)
            if congratulation_date.weekday() == 5:
                # додаємо до списку на наступний понеділок
                congratulation_date += timedelta(days=2)
            elif congratulation_date.weekday() == 6:
                 # додаємо до списку на наступний понеділок
                congratulation_date += timedelta(days=1)
            # Додаємо до списку працівників у яких день народження на цьому тижні
            upcoming_birthdays.append({
                "name": user["name"],
                "congratulation_date": congratulation_date.strftime("%Y.%m.%d")
            })
upcoming_birthdays = get_upcoming_birthdays(users)
print("Список привітань на цьому тижні:", upcoming_birthdays)